# Set the directory for installing applications and casks.
cask_args appdir: '/Applications'

# Install necessary `homebrew`, `macOS` and third party taps.
tap 'argon/mas'
tap 'avasilic/goto'
tap 'buo/cask-upgrade'

# Install dependencies for various utilities and applications.
brew 'aria2'
brew 'atuin'
brew 'bat'
brew 'bottom'
brew 'displayplacer'
brew 'eva'
brew 'eza'
brew 'fastfetch'
brew 'fd'
brew 'fdupes'
brew 'ffmpeg'
brew 'fish'
brew 'fisher'
brew 'fzf'
brew 'gh'
brew 'helix'
brew 'jless'
brew 'mas'
brew 'mise'
brew 'scrcpy'
brew 'sd'
brew 'starship'
brew 'superfile'
brew 'telnet'
brew 'tig'
brew 'goto-ssh'
brew 'xh'
brew 'zoxide'

# Install applications.
cask '1password'
cask 'android-platform-tools'
cask 'brave-browser'
cask 'docker'
cask 'filen'
cask 'font-fira-code'
cask 'google-chrome'
cask 'kdiff3'
cask 'localsend'
cask 'maccy'
cask 'macfuse'
cask 'mediosz/tap/swipeaerospace'
cask 'mocki-toki/formulae/barik'
cask 'nikitabobko/tap/aerospace'
cask 'nordvpn'
cask 'obsidian'
cask 'postman'
cask 'signal'
cask 'spotify'
cask 'stremio'
cask 'sublime-text'
cask 'syncthing'
# TODO: Check if we can replace `utm` with `quickemu` and `quickgui`.
cask 'utm'
cask 'veracrypt'
cask 'viber'
cask 'visual-studio-code'
cask 'vlc'
cask 'wezterm'
